
import csv
# full_wm = ['2023-03-22', '월드와이드메모리', '1,000', '4,000', '25,000', '2,000', '12,000', '40,000', '13,000', '30,000', '67,000', '17,000', '45,000', '100,000', '50,000', '66,000', '130,000', '65,000', '95,000', '200,000', '1,000', '11,000', '4,000', '11,000', '26,000', '5,000', '15,000', '20,000', '25,000', '40,000', None]
# full_nm = ['2023-03-22', '나노메모리', 0, '4,000', '25,000', 0, '12,000', '40,000', '13,000', '30,000', '70,000', '20,000', '45,000', '10,000', '50,000', '68,000', '132,000', '65,000', '90,000', '175,000', '1,000', '11,000', '26,000', '11,000', '4,000', 0, '15,000', '25,000', '30,000', 0, None]
# full_danawa = ['2023-03-22', '다나와', '11,630', '31,400', '36,630', '75,000', '84,850', '122,100', '15,590', '27,990', '52,500', '79,200', '123,470', '131,150', '57,940', '81,200', '116,990', '177,510', '217,000', '297,200', '4,400', '21,080', '13,000', '22,620', '48,840', 0, 0, 0, 0, 0, None]

# def save_to_file(file_name, final):
#   file=open(f"{file_name}.csv", "w")
#   file.write("날짜,사이트명,i3-3250,i3-4370,i3-6300,i3-7300(주력모델),i3-8100,i3-9100,i5-3470,i5-4570,i5-6500,i5-7400(주력모델),i5-8400,i5-9400,i7-3770,i7-4770,i7-6700,i7-7700(주력모델),i7-8700,i7-9700,DDR3 4G,DDR3 8G,DDR3 4G,DDR3 8G,DDR3 16G,모니터 LCD 20~23인치,모니터 LED 22인치,모니터 LED 23인치,모니터 LED 24인치,모니터 LED 27인치,비고")

#   for job in final:
#     file.write(f"{job},")
#   file.close()

#   # csv 모듈을 import 합니다.


# csv 파일을 쓰기 모드로 열고, 파일 객체를 생성합니다.
import csv


# def write_csv():
#     with open('computer_price.csv', 'w', newline='') as file:
#         fieldnames = ['날짜', '사이트명', 'i3-3250', 'i3-4370', 'i3-6300', 'i3-7300(주력모델)', 'i3-8100', 'i3-9100', 'i5-3470', 'i5-4570', 'i5-6500', 'i5-7400(주력모델)', 'i5-8400', 'i5-9400', 'i7-3770', 'i7-4770',
#                       'i7-6700', 'i7-7700(주력모델)', 'i7-8700', 'i7-9700', 'DDR3 4G', 'DDR3 8G', 'DDR3 4G', 'DDR3 8G', 'DDR3 16G', '모니터 LCD 20~23인치', '모니터 LED 22인치', '모니터 LED 23인치', '모니터 LED 24인치', '모니터 LED 27인치', '비고']
#         full_wm = ['2023-03-22', '월드와이드메모리', '1,000', '4,000', '25,000', '2,000', '12,000', '40,000', '13,000', '30,000', '67,000', '17,000', '45,000', '100,000', '50,000',
#                    '66,000', '130,000', '65,000', '95,000', '200,000', '1,000', '11,000', '4,000', '11,000', '26,000', '5,000', '15,000', '20,000', '25,000', '40,000', None]
#         full_nm = ['2023-03-22', '나노메모리', 0, '4,000', '25,000', 0, '12,000', '40,000', '13,000', '30,000', '70,000', '20,000', '45,000', '10,000', '50,000',
#                    '68,000', '132,000', '65,000', '90,000', '175,000', '1,000', '11,000', '26,000', '11,000', '4,000', 0, '15,000', '25,000', '30,000', 0, None]
#         full_danawa = ['2023-03-22', '다나와', '11,630', '31,400', '36,630', '75,000', '84,850', '122,100', '15,590', '27,990', '52,500', '79,200', '123,470',
#                        '131,150', '57,940', '81,200', '116,990', '177,510', '217,000', '297,200', '4,400', '21,080', '13,000', '22,620', '48,840', 0, 0, 0, 0, 0, None]
#         writer = csv.writer(file)
#         writer.writerow(fieldnames)
#         writer.writerow(full_wm)
#         writer.writerow(full_nm)
#         writer.writerow(full_danawa)
# write_csv()

```


def save_to_file(file_name):  # 함수 정의, 매개변수로 파일 이름을 받음
    file = open(f"{file_name}.csv", "w")  # 파일을 쓰기 모드로 열고 file 변수에 할당
    fieldnames = ['날짜', '사이트명', 'i3-3250', 'i3-4370', 'i3-6300', 'i3-7300(주력모델)', 'i3-8100', 'i3-9100', 'i5-3470', 'i5-4570', 'i5-6500', 'i5-7400(주력모델)', 'i5-8400', 'i5-9400', 'i7-3770', 'i7-4770',
                  'i7-6700', 'i7-7700(주력모델)', 'i7-8700', 'i7-9700', 'DDR3 4G', 'DDR3 8G', 'DDR3 4G', 'DDR3 8G', 'DDR3 16G', '모니터 LCD 20~23인치', '모니터 LED 22인치', '모니터 LED 23인치', '모니터 LED 24인치', '모니터 LED 27인치', '비고']  # 필드명을 리스트로 할당
    full_wm = ['2023-03-22', '월드와이드메모리', '1,000', '4,000', '25,000', '2,000', '12,000', '40,000', '13,000', '30,000', '67,000', '17,000', '45,000', '100,000', '50,000',
               '66,000', '130,000', '65,000', '95,000', '200,000', '1,000', '11,000', '4,000', '11,000', '26,000', '5,000', '15,000', '20,000', '25,000', '40,000', None]  # 월드와이드메모리 데이터를 리스트로 할당
    full_nm = ['2023-03-22', '나노메모리', 0, '4,000', '25,000', 0, '12,000', '40,000', '13,000', '30,000', '70,000', '20,000', '45,000', '10,000', '50,000',
               '68,000', '132,000', '65,000', '90,000', '175,000', '1,000', '11,000', '26,000', '11,000', '4,000', 0, '15,000', '25,000', '30,000', 0, None]  # 나노메모리 데이터를 리스트로 할당
    full_danawa = ['2023-03-22', '다나와', '11,630', '31,400', '36,630', '75,000', '84,850', '122,100', '15,590', '27,990', '52,500', '79,200', '123,470',
                   '131,150', '57,940', '81,200', '116,990', '177,510', '217,000', '297,200', '4,400', '21,080', '13,000', '22,620', '48,840', 0, 0, 0, 0, 0, None]  # 다나와 데이터를 리스트로 할당
    writer = csv.writer(file)  # csv 모듈의 writer 함수를 사용하여 파일에 쓰기 위한 writer 객체 생성
    writer.writerow(fieldnames)  # 필드명을 파일에 쓰기
    writer.writerow(full_wm)  # 월드와이드메모리 데이터를 파일에 쓰기
    writer.writerow(full_nm)  # 나노메모리 데이터를 파일에 쓰기
    writer.writerow(full_danawa)  # 다나와 데이터를 파일에 쓰기
        
    # for job in final:
    #     file.write(f"{job},")
    # file.close()

save_to_file(file_name="data1")


# 파일을 쓰기 모드로 열기
with open('file.csv', 'w', encoding='utf-8-sig', newline='') as file:
    writer = csv.writer(file)
    # 데이터 쓰기
    writer.writerow(['이름', '나이', '성별'])
    writer.writerow(['홍길동', '20', '남'])
    writer.writerow(['김철수', '25', '남'])

# 파일을 읽기 모드로 열기
with open('file.csv', 'r', encoding='utf-8-sig') as file:
    reader = csv.reader(file)
    # 데이터 읽기
    for row in reader:
        print(row)
